def display_menu() -> None:
  print('===================================')
  print('Списки товарів                     ')
  print('===================================')
  print('  1 - Вивести список всіх товарів  ')
  print('  2 - Список товарів в категорії   ')
  print('  3 - Інформація по товару         ')
  print('  4 - Пошук товарів                ')
  print('  5 - Додавання товару             ')
  print('  6 - Видалення товару             ')
  print('  7 - Видалення товару             ')
  print('  9 - Завершення програми          ')
  print('===================================')


def get_choice() -> int:
  choice = int(input('Виберіть потрібну дію: '))
  return choice


def allow_continue() -> bool:
  answer = input('Продовжуати (y/n)? - ')
  return answer == 'y'
  